package spammer

import (
	"math/rand"
	"time"
)

var ObfDictionary = map[rune][]rune{
	'А': {'À', 'Á', 'Â', 'Ã', 'Ä', 'Å'},
	'а': {'à', 'á', 'â', 'ã', 'ä', 'å'},
	'Б': {'Ƃ', 'ƃ', 'Ҕ', 'Ϭ', 'Ђ', 'ß'},
	'б': {'ҕ', 'ɓ', 'ẟ', 'ƀ', 'ᶀ', 'ᵬ'},
	'В': {'Ѷ', 'Ṽ', 'Ṿ', 'V', 'Ŵ', 'Ẁ'},
	'в': {'v', 'ѷ', 'ṽ', 'ṿ', 'ẁ', 'ẇ'},
	'Г': {'Ĝ', 'Ğ', 'Ġ', 'Ģ', 'Ḡ', 'Ꞡ'},
	'г': {'ĝ', 'ģ', 'ġ', 'ğ', 'ḡ', 'ꞡ'},
	'Д': {'Ḋ', 'Ḍ', 'Ḏ', 'Ḑ', 'Ḓ', 'Ɗ'},
	'д': {'ď', 'đ', 'ḋ', 'ḍ', 'ḏ', 'ḑ'},
	'Е': {'È', 'É', 'Ê', 'Ë', 'Ē', 'Ĕ'},
	'е': {'ẻ', 'ẽ', 'ế', 'ề', 'ể', 'ễ'},
	'Ё': {'Ė', 'Ę', 'Ě', 'Ε', 'Ḕ'},
	'ё': {'ḕ', 'ḗ', 'ḛ', 'ḝ', 'ẹ'},
	'Ж': {'Ӂ', 'Җ', 'Ӝ'},
	'ж': {'ӂ', 'ӝ', 'җ'},
	'З': {'Ǯ', 'Ʒ', 'Ż', 'Ź', 'Ȥ', 'Ž'},
	'з': {'ʓ', 'ᴣ', 'ᶚ', 'ʒ', 'ǯ', 'ƺ'},
	'И': {'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ', 'Ȋ'},
	'и': {'ĩ', 'ī', 'ĭ', 'į', 'ȋ', 'ȉ'},
	'Й': {'Y', 'Ѝ', 'Ҋ', 'Ỉ', 'Ἴ', 'Ἵ'},
	'й': {'y', 'ҋ', 'ἰ', 'ἱ', 'ἲ', 'ἳ'},
	'К': {'Ќ', 'Ϗ', 'Κ', 'Ķ', 'Ǩ', 'Қ'},
	'к': {'қ', 'ҝ', 'ҟ', 'ҡ', 'ⱪ', 'ꝁ'},
	'Л': {'Ӆ', 'Ĺ', 'Ļ', 'Ľ', 'Ŀ', 'Ł'},
	'л': {'ŀ', 'ľ', 'ļ', 'ĺ', 'ԓ', 'ԉ'},
	'М': {'Ɱ', 'Ṃ', 'Ṁ', 'Ḿ', 'Ӎ', 'Μ'},
	'м': {'ӎ', 'ṃ', 'ṁ', 'ḿ', 'ᶆ', 'ꝳ'},
	'Н': {'Ἣ', 'Ἤ', 'Ἥ', 'Ἦ', 'Ἧ', 'Ⱨ'},
	'н': {'ң', 'ҥ', 'ӊ', 'ӈ', 'ր', 'ղ'},
	'О': {'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ő'},
	'о': {'ő', 'ŏ', 'ō', 'ö', 'õ', 'ô'},
	'П': {'Ᵽ', 'Ꝑ', 'Ꝥ', 'Ꝧ', 'Ƥ', 'Ꝓ'},
	'п': {'ꝓ', 'ꝑ', 'ᵱ', 'ᵽ', 'ṗ', 'ṕ'},
	'Р': {'Ṙ', 'Ṛ', 'Ṝ', 'Ṟ', 'Ř', 'Ŗ'},
	'р': {'ṟ', 'ȑ', 'ȓ', 'ŕ', 'ŗ', 'ř'},
	'С': {'Ṩ', 'Ṧ', 'Ṥ', 'Ṣ', 'Ṡ', 'Ś'},
	'с': {'ṩ', 'ṧ', 'ṥ', 'ṣ', 'ṡ', 'ȿ'},
	'Т': {'Ť', '⍡', 'Ṫ', 'Ţ', 'Ț', 'T'},
	'т': {'ṱ', 'ṯ', 'ṭ', 'ṫ', 't', 'ᵵ'},
	'У': {'Ý', 'Ÿ', 'ϔ', 'ϓ', 'Ү', 'Ӯ'},
	'у': {'ŷ', 'ʏ', 'ӱ', 'ӳ', 'ỵ', 'ꭚ'},
	'Ф': {'Ꞙ', 'Ƒ', 'ᵮ', '₣', 'ȹ', 'Ғ'},
	'ф': {'ꞙ', 'ƒ', 'ᵠ', 'ẝ', 'ẜ', 'ғ'},
	'Х': {'X', 'Ẋ', 'Ẍ', 'א', 'ᶍ', 'ꭓ'},
	'х': {'ẋ', 'ẍ', 'ˣ', 'ꭖ', 'ꭘ', 'ꭙ'},
	'Ц': {'Ա', 'ų', 'ℭ', 'Ċ', 'Ḉ', '₵'},
	'ц': {'ç', 'ų', 'ĉ', 'č', 'ċ', 'ḉ'},
	'Ч': {'Կ', '੫', 'Ӵ', 'Ҹ', 'Ӌ'},
	'ч': {'կ', 'ӵ', 'ҹ', 'ҷ', 'ӌ'},
	'Ш': {'ש', 'ᗯ', 'Ϣ', 'Ꮚ', 'ᙡ', 'พ'},
	'ш': {'ϣ', 'ω', 'ŵ', 'ѡ', 'ώ', 'ẃ'},
	'Щ': {'ש', 'ᗯ', 'Ϣ', 'ᙡ', 'Ɯ', 'ಭ'},
	'щ': {'ᶭ', 'ᴪ', 'ᵚ', '⍹', 'ώ', 'ῷ'},
	'Ы': {'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ', 'Ȋ'},
	'ы': {'ĩ', 'ī', 'ĭ', 'į', 'ȋ', 'ȉ'},
	'Э': {'∋', '∌', 'Ӭ', '℈', 'ヨ', 'Э'},
	'э': {'ӭ', '∍', 'є', '£', 'ع', 'ε'},
	'Ю': {'Ų', 'Ũ', 'Ա', 'U', 'Ű', 'Ủ'},
	'ю': {'ϋ', 'น', 'ự', 'ů', 'ữ', 'ᙀ'},
	'Я': {'ᖆ'},
}

const ReplaceProbability = 50

func Obfuscate(str string) string {
	s := []rune(str)

	for i, c := range s {
		rand.Seed(time.Now().UnixNano())

		if r, ok := ObfDictionary[c]; ok {
			if rand.Intn(100) > ReplaceProbability {
				continue
			}

			s[i] = r[rand.Intn(len(r))]
		}

		time.Sleep(time.Nanosecond)
	}

	return string(s)
}
